tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

####### <-----------------------------  CLI
brew "bash-completion"
brew "git"
brew "git-lfs"
brew "git-recent"
brew "nvm"
brew "pyenv"
brew "pyenv-virtualenv"
brew "yarn"
# brew "readline", link: true
# cask "osxfuse"
# brew "sshfs"
brew "thefuck"
brew "m-cli"
brew "tmux"
brew "rlwrap"

####### <----------------------------- DB
cask "postico"
cask "tableplus"
# cask "robo-3t"
# brew "mongodb", restart_service: true

####### <----------------------------- EDITORS
# cask "atom"
cask "visual-studio-code"
cask "meld"                                    # diff UI tool
# cask "sublime-text"                

####### <----------------------------- DEV
cask "docker"
cask "iterm2"
cask "tower"
brew "docker-compose"
brew "pre-commit"
brew "terraform"
brew "nomad"
# cask "postman"
# cask "staruml"
# brew "exercism"
# brew "haskell-stack"

####### <----------------------------- MESSENGERS
cask "slack"
cask "telegram-desktop"
cask "microsoft-teams"
cask "zoom"
# cask "viber"
# cask "skype"
# cask "discord"

####### <----------------------------- APPS
cask "visual-studio-code"
cask "google-chrome"
# cask "github"
cask "spotify"
# cask "chromium"
# cask "steam"
# cask "folx"
cask "alfred"
cask "bartender"
cask "spectacle"
cask "dash"         # api documentation browser
cask "copyq"

####### <----------------------------- MISC
# cask "yandex-disk"
cask "raven-reader"
cask "openvpn-connect"
cask "hammerspoon"
cask "gather"
brew "graphviz"
brew "fontconfig"
# cask "insomniax"
# cask "vlc"

####### <----------------------------- HELPERS
cask "ngrok"
cask "numi"
cask "boop"
# cask "ace-link"

