tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

####### <-----------------------------  CLI
# brew "bash-completion"
brew "git"
# brew "git-lfs"
brew "git-recent"                   # See your latest local git branches, formatted real fancy
# brew "nvm"                          # Manage multiple Node.js versions
# brew "pyenv"
# brew "pyenv-virtualenv"
# brew "yarn"
# cask "osxfuse"
# brew "sshfs"
brew "thefuck"                      # Programmatically correct mistyped console commands
brew "m-cli"                        # Swiss Army Knife for macOS (man)
brew "tmux"                         # Terminal multiplexer
# brew "readline", link: true         # Library for command-line editing
brew "rlwrap"                       # Readline wrapper: adds readline support to tools that lack it
brew "s3cmd"                        # Command-line tool for the Amazon S3 service

####### <----------------------------- DB
cask "postico"
cask "tableplus"
# cask "robo-3t"
# brew "mongodb", restart_service: true

####### <----------------------------- EDITORS
# cask "atom"
cask "visual-studio-code"
cask "meld"                         # diff UI tool
# cask "sublime-text"                

####### <----------------------------- DEV
cask "docker"
# brew "podman"
cask "iterm2"
# cask "tower"                        # Git client focusing on power and productivity
brew "docker-compose"
brew "pre-commit"
brew "terraform"
brew "nomad"
# cask "postman"
# cask "staruml"
# brew "exercism"
# brew "haskell-stack"

####### <----------------------------- MESSENGERS
cask "slack"                        # Team communication and collaboration software
cask "telegram"                     # Messaging app with a focus on speed and security
cask "microsoft-teams"              # Meet, chat, call, and collaborate in just one place
cask "zoom"                         # Video communication and virtual meeting platform
# cask "viber"
# cask "skype"
# cask "discord"

####### <----------------------------- APPS
cask "1password"
cask "google-chrome"                # Web browser 
cask "firefox"                      # Web browser    
cask "yandex"                       # Web browser
# cask "github"
cask "spotify"
cask "balenaetcher"                 # Tool to flash OS images to SD cards & USB drives
# cask "chromium"
# cask "steam"
# cask "folx"
cask "alfred"
cask "bartender"
cask "spectacle"
cask "dash"                         # API documentation browser and code snippet manager
cask "obsidian"                     # Knowledge base that works on top of a local folder of plain text Markdown files
cask "copyq"

####### <----------------------------- MISC
# cask "yandex-disk"
cask "raven-reader"                 # News reader with flexible settings
cask "openvpn-connect"
cask "hammerspoon"
# cask "gather"
brew "graphviz"
brew "fontconfig"
# cask "insomniax"
# cask "vlc"

####### <----------------------------- HELPERS
cask "ngrok"                        # Reverse proxy, secure introspectable tunnels to localhost https://ngrok.com/
cask "numi"                         # Calculator and converter application https://numi.app/
cask "boop"                         # encoding/decoding messages https://boop.okat.best/
# cask "ace-link"

